In [1]:
import pandas as pd

In [2]:
data1 = {'Name': ['Tom', 'Joseph', 'Bob'], 'Age': [20, 21, 19],'Category': ['A', 'B', 'A']}

df1 = pd.DataFrame(data1)
df1

     Name  Age Category
0     Tom   20        A
1  Joseph   21        B
2     Bob   19        A

In [3]:
df1.groupby('Category')['Age'].mean() ##categoryごとの年齢の平均

Category
A    19.5
B    21.0
Name: Age, dtype: float64

In [4]:
df1.groupby('Category')['Age'].sum() ##categoryごとの年齢の合計

Category
A    39
B    21
Name: Age, dtype: int64

In [5]:
df1["Sales"] = [200,300,400]
df1

     Name  Age Category  Sales
0     Tom   20        A    200
1  Joseph   21        B    300
2     Bob   19        A    400

In [6]:
pd.crosstab(df1['Category'],df1['Age']) ##categoryごとの年齢のクロス集計

Age       19  20  21
Category
A          1   1   0
B          0   0   1

In [7]:
df1["Gender"] = ["M","F","M"]
df1

     Name  Age Category  Sales Gender
0     Tom   20        A    200      M
1  Joseph   21        B    300      F
2     Bob   19        A    400      M

In [10]:
df1.pivot_table(index='Category', columns="Gender", values="Age", aggfunc="mean") ##categoryごとの性別別の年齢の平均のピボットテーブル
## (index=行, columns=列, values=集計する値, aggfunc=集計方法)

Gender       F     M
Category
A          NaN  19.5
B         21.0   NaN

In [17]:
data3 = ["2024-01-01","2024-01-02","2024-01-03"]
data3_Date = pd.to_datetime(data3) ##日付型(datetime64型)に変換してdata3_Dateに格納
df1["Date"] = data3_Date ##data3_Dateをdf1に追加
df1

     Name  Age Category  Sales Gender       Date
0     Tom   20        A    200      M 2024-01-01
1  Joseph   21        B    300      F 2024-01-02
2     Bob   19        A    400      M 2024-01-03

In [18]:
df1["Date"].dt.year ##年を取得

0    2024
1    2024
2    2024
Name: Date, dtype: int32

In [21]:
df1["Date"].dt.day ##日を取得

0    1
1    2
2    3
Name: Date, dtype: int32